# Δημιουργία στιγμιοτύπου / αντικειμένου
#
#
# Για να χρησιμοποιήσουμε την κλάση πρέπει να δημιουργήσουμε ένα αντικείμενο
# σε αυτήν. Αυτό είναι γνωστό ως "δημιουργία αντικειμένου", "instantiating
# object". Ένα αντικείμενο είναι επίσης γνωστό και ως στιγμιότυπο.
# Αν και υπάρχουν κάποιες διαφορές μεταξύ ενός αντικειμένου και ενός
# στιγμιοτύπου, αυτές είναι περισσότερο σημασιολογικές και μπορούμε να 
# χρησιμοποιήσουμε και τις δύο λέξεις.
#
# Ας δημιουργήσουμε ένα αντικείμενο Staff.
class Staff:
    def __init__(self, pPosition, pName, pPay):
        self.position = pPosition
        self.name = pName
        self.pay = pPay
        print('Δημιουργία του αντικειμένου "Προσωπικό"')
        
    def __str__(self):
        return 'Θέση = %s, Name = %s, Pay = %d' % (self.position,
                                                   self.name, self.pay)
    
    def calculatePay(self):
        hours = int(input('\nΕισάγετε τις ώρες εργασίας σας %s: ' % (self.name)))
        hourlyRate = int(input('\nΕισάγετε το ωρομίσθιό σας %s: ' % (self.name)))
        self.pay = hours * hourlyRate
        
        return self.pay

# Τώρα μπορούμε να δημιουργήσουμε ένα αντικείμενο της κλάσης Staff.
# Για να το κάνουμε αυτό, γράφουμε:
officeStaff1 = Staff('Basic', 'John Doe', 0)

# Αυτό είναι λίγο παρόμοι με τον τρόπο που δηλώνουμε μια μεταβλητή όπου γράφουμε
# π.χ. userAge = 10.
#
# Σε αυτήν την περίπτωση, το officeStaff1 είναι το όνομα της μεταβλητής. Ωστόσο,
# αφού το officeStaff1 δεν είναι ένας ακέραιος αριθμός, δεν του αντιστοιχίζουμε
# έναν αριθμό. Αντ' αυτού, γράφουμε
#                    Staff('Basic', 'John Doe', 0)
# στη δεξιά πλευρά. Όταν το κάνουμε αυτό, ουσιαστικά ζητάμε από την κλάση Staff 
# να δημιουργήσει ένα αντικείμενο Staff και να χρησιμοποιήσει τη μέθοδο __init__
# για να αρχικοποιήσει τις μεταβλητές στιγμιοτύπου στην κλάση.
#
# Ας παρατηρήσουμε όμως, ότι έχουμε τρεις τιμές (θέση, όνομα, πληρωμή) μέσα στις παρενθέσεις.
# Αυτές είναι για τις παραμέτρους pPosition, pName και pPay στη μέθοδο __init__ που κωδικο-
# ποιήσαμε προηγουμένως.
#
# Χρησιμοποιούμε αυτές τις τρεις τιμές για να αρχικοποιήσουμε αντίστοιχα τις μεταβλητές
# στιγμιοτύπου position, name και pay.
#
#
#
# Τι συμβαίνει με την παράμετρο self???
# -------------------------------------
# Δεν χρειάζεται να περάσουμε τίποτα για την παράμετρο self. Είναι μια ειδική παράμετρος και 
# η Python θα την προσθέσει αυτόματα κατά την κλήση της μεθόδου.
# Αφού δημιουργήσουμε αυτό το αντικείμενο, το αναθέτουμε στο officeStaff1.
# Ας δοκιμάσουμε να πληκτρολογήσουμε την παρακάτω δήλωση:
officeStaff1 = Staff('Basic', 'John Doe', 0)

# Θα δούμε το μήνυμα
#           'Δημιουργία του αντικειμένου "Προσωπικό"'
# να εμφανίζεται στην οθόνη. Αυτό υποδηλώνει ότι η function __init__ καλείται κανονικά.
#
# Tώρα που έχουμε δημιθουργήσει ένα αντικείμενο της κλάσης staff, μπορούμε να το χρησιμοποιήσουμε
# για να έχουμε πρόσβαση στις μεταβλητές στιγμιοτύπου και τις μεθόδους μέσα στην κλάση. Για να το
# κάνουμε αυτό, χρησιμοποιούμε τον τελεστή τελείας μετά το όνομα του αντικειμένου για να έχουμε
# πρόσβαση σε οποιαδήποτε μεταβλητή στιγμιοτύπου ή μέθοδο στην κλάση Staff.
#
# Για παράδειγμα, για να έχουμε πρόσβαση στη μεταβλητή στιγμιοτύπου name, πληκτρολογούμε
#   officeStaff1.name
# Αντίστοιχος τρόπος είναι και στις υπόλοιπες μεταβλητές
# 
# Η μέθοδος __str__ θα εκτελεστεί στην περίπτωση που κάνουμε
print(officeStaff1)