# Πλεονεκτήματα της χρήσης Tk themed widgets
#
#
# Χρησιμοποιώντας τα themed widgets επιτυγχάνεται:
#   1. Διαχωρισμός της συμπεριφοράς και της εμφάνισης του γραφικού στοιχείου
#      - τα γραφικά στοιχεία ttk προσπαθούν να διαχωρίσουν τον κώδικα που
#      υλοποιεί τις συμπεριφορές των γραφικών στοιχείων από την εμφάνισή τους
#      μέσω του συστήματος στυλ.
#   2. Εγγενής εμφάνιση και αίσθηση - τα γραφικά στποχεια ttk έχουν την εγγενή
#      εμφάνιση και αίσθηση της πλατφόρμας στην οποία εκτελείται το πρόγραμμα.
#   3. Απλοποίηση της συμπεριφοράς των γραφικών στοιχείων σε ειδικές καταστάσεις
#
# Τα παρακάτω γραφικά στοιχεία ttk αντικαθιστούν τα γραφικά στοιχεία Tkinter με
# τα ίδια ονόματα:
#   - Button
#   - Checkbutton
#   - Entry
#   - Frame
#   - Label
#   - LabelFrame
#   - Menubutton
#   - PanedWindow
#   - Radiobutton
#   - Scale
#   - Scrollbar
#   - Spinbox
#
# Νέα στοιχεία ttk:
#   - Combobox
#   - Notebook
#   - Progressbar
#   - Separator
#   - Sizegrip
#   - Treeview
#
# Πλήρη αναφορά για τα themed widget μπορείτε να βρείτε στην 
# https://docs.python.org/3/library/tkinter.ttk.html
#
#
# Συμπερασματικά:
#   - το Tkinter, έχει κλασικά αλλά και themed widgets (ttk)
#   - Το module, tkinter.ttk περιέχει όλα τα ttk widgets
#   - Όταν είναι διαθέσιμα, καλό είναι να χρησιμοποιούμε τα themed widgets
