# Ανακεφαλαίωση - Νέες μέθοδοι
#
#   - Χρήση της μεθόδου title() για να αλλάξετε τον τίτλο του παραθύρου
#   - Χρήση της μεθόδου geometry() για να αλλάξετε το μέγεθος και τη θέση
#     του παραθύρου
#   - Χρήση της μεθόδου resizable() για να καθορίσετε εάν ένα παράθυρο
#     μπορεί να αλλάξει μέγεθος οριζόντια ή κάθετσ
#   - Χρήση του window.attributes('-alpha', 0.5) για να ορίσουμε transparency
#     στο παράθυρο
#   - Χρήση του window.attributes('-topmost', 1) για να κάνουμ το παράθυρο
#     να είναι πάντα στην κορυφή
#   - Χρήση των μεθόδων lift() και low() για να μετακινήσουμε το παράθυρο πάνω
#     και κάτω στη σειρά στοίβαξης παραθύρων
#   - Χρήση της μεθόδου iconbitmap() για να αλλάξουμε το προεπιλεγμένο εικονίδιο
#     του παραθύρου