# Εισαγωγή στα Tk themed Widgets
#
#
# Το Tkinter έχει δύο γενιές widgets:
#
# Τα παλιά κλασικά γραφικά στοιχεία tk. Παρουσιάστηκαν το 1991.
# Τα νεότερα θεματικά γραφικά στοιχεία ttk προστέθηκαν το 2007 με το
# Tk 8.5. Τα νεότερα γραφικά στοιχεία με θέμα Tk αντικαθιστούν πολλά
# (αλλά όχι όλα) κλασικά γραφικά στοιχεία.
#
# Σημειώστε ότι το ttk σημαίνει Tk theme. Επομένως, τα γραφικά στοιχεία
# με θέμα Tk (themed) είναι τα ίδια με τα γραφικά στοιχεία ttk
#
# Η ενότητα tkinter.ttk περιέχει όλα τα νέα γραφικά στοιχεία ttk. Είναι
# καλή πρακτική να χρησιμοποιούμε πάντα θεματικά γραφικά στοιχεία όποτε
# είναι διαθέσιμα
#
# Οι ακόλουθες δηλώσεις εισάγουν τα κλασικά και τα νέα γραφικά στοιχεία
# με θέμα Tk και δημιουργούν κλασικές θεματικές ετικέτες:
import tkinter as tk
from tkinter import ttk

root = tk.Tk()

tk.Label(root, text='Κλασική ετικέτα').pack()
ttk.Label(root, text='Θεματική ετικέτα').pack()

root.mainloop()

# Και οι δύο ετικέτες μοιάζουν παρόμοιες. Όμως η εμφάνισή τους εξαρτάται
# από την πλατφόρμα στην οποία εκτελείται το πρόγραμμα.