# Εισαγωγή στο Tkinter
#
#
# Το Tkinter προφέρεται ως tea-kay-inter. To Tkinter είναι η διεπαφή της Python
# με το Tk, η οποία είναι εργαλειοθήκη GUI (Graphical User Interface - Γραφική
# Διεπαφή Χρήστη) για το Tcl / Tk.
#
# H Tcl (προφέρεται ως tickle = γαργαλητό) είναι μια γλώσσα δέσμης ενεργειών που
# χρησιμοποιείται συχνά σε δοκιμές, πρωτότυπα και ανάπτυξη GUI.
#
# Το Tk είναι μια εργαλειοθήκη γραφικών στοιχείων ανοιχτού κώδικα, πολλαπλών πλατ-
# φορμών που χρησιμποιείται από πολλές διαφορετικές γλώσσες προγραμματισμού για τη
# δημιουργία προγραμμάτων GUI.
#
# Η Python υλοποιεί το Tkinter σαν ένα module. To Tkinter είναι ένας wrapper επεκ-
# τάσεων της C που χρησιμοποιούν βιβλιοθήκες Tcl / Tk.
#
# To Tkinter μας επιτρέπει να αναπτύσσουμε εφαρμογές desktop. Είναι ένα πολύ καλό
# εργαλείο για προγραμματισμό γραφικών διεπαφών στην Python.
#
# Το Tkinter είναι μια καλή επιλογή για τους ακόλουθους λόγους:
#   - Είναι εύκολο στην εκμάθηση
#   - Χρησιμοποιεί πολύ λίγο κώδικα για να δημιουργήσει μια λειτουργική εφαρμογή
#     επιφάνειας εργασίας.
#   - Σχεδιάζεται σε πολλά επίπεδα (layers)
#   - Είναι φορητό σε όλα τα λειτουργικά συστήματα, συμπεριλαμβανομένων των Windows,
#     macOS & Linux.
#   - Είναι προεγκατεστημένο στην Python.