# Σημείωση
#
# Το ttk είναι ένα module το οποίο παρουσιάστηκε μετά το tkinter 8.5
# στην προσπάθεια να ξεχωρίσει τη λειτουργικότητα των παραθύρων από
# την εμφάνισή τους. Πρέπει να χρησιμοποιείται με προσοχή, καθότι δεν
# υπάρχει πλήρης συμβατότητα με τις παραμέτρους και τις μεθόδους τοy
# tk.
#
#
#
# --------------------------------------------------------------------
#
# Tkinter II
#
# Έχουμε δει ότι το Tkinter είναι η τυπική βιβλιοθήκη GUI για την Python.
# Η Python όταν συνδυάζεται με το Tkinter παρέχει έναν γρήγορο και εύκολο
# τρόπο δημιουργίας εφαρμογών GUI. To Tkinter είναι μια ισχυρή αντικειμε-
# νοστραφής διεπαφή στην εργαλειοθήκη Tk GUI.
#
# Σε γενικές γραμμές, για να δημιουργήσουμε ένα γραφικό περιβάλλον με το
# Tkinter, κάνουμε τα παρακάτω βήματα:
#   - Κάνουμε import το Tkinter
#   - Δημιουργούμε το κύριο παράθυρο της εφαρμογής GUI.
#   - Προσθλέτουμε ένα ή περισσότερα από γραφικά στοιχεία στην εφαρμογή
#   - Εισάγουμε τον κύριο βρόχο συμβάντος ώστε πλέον η διεπαφή/εφαρμογή
#     μας να μπορεί να "ακούει" τον χρήστη.
#
# Υπενθυμίζουμε ένα απλό παράδειγμα γραφικής διεπαφής το οποίο μπορούμε να
# τρέξουμε και γραμμή-γραμμή στον IDLE:
#
#

import tkinter as tk

top = tk.Tk()
top.mainloop()

#
# Σαν έξοδο έχουμε ένα παράθυρο.

