print("Lesson 9")
print("Lesson object: file management (.txt files & more) - write")

# open the .txt file
f = open('myfile.txt', 'r')         # --> open the requested file
        # open() function:
            # two arguments: 1. the file path
            #                2. the open mode ('w'->write, 'r'->read)
            #
            #
            # Αν το αρχείο που επιθυμούμε να ανοίξουμε υπάρχει ήδη, τότε τα δεδομένα του
            # αρχείου αυτού διαγράφονται-σβήνονται και στην συνέχεια δημιουργούνται οι
            # νέες εγγραφές. (τα παλιά δεδομένα, αντικαθίστατε από τα νέα)
            #
            # Αν το αρχείο δεν υπάρχει, τότε απλά δημιουργείται και είναι ετοίμο για να
            # γράψουμε δεδομένα σε αυτό.
            #
            # Το path που χρησιμοποιύμε στην συνάτρτηση προκειμένου να ανοίξουμε το αρχείο,
            # πρέπει να προϋπάρχει, διαφορετικά θα εμφανιστεί μήνυμα λάθους. Δεν αναφερόμα-
            # στε στην τελική κατάληξη, που είναι το αρχείο, αλλά στο υπόλοιπο μονοπάτι.

firstline = f.readline()
secondline = f.readline()
    # readline() function
    # Χρησιμοποιείται για να διαβάσει μία γραμμή από το αρχείο που έχει ανοιχτεί στην
    # μεταβλητή f.
    # Κάθε φορά που καλείται, διαβάζεται η επόμενη σειρά, η ανάγνωση ξεκινάει από την πρώτη
    # γραμμή του αρχείου και μπορεί να φτάσει μέχρι το τέλος, με το κάθε κάλεσμά της να 
    # δείχνει σε παρακάτω γραμμή (n + 1 row)
    # Η συνάρτηση readline, προσθέτει έναν χαρακτήρα διαφυγής '\n' στο τέλος κάθε γραμμής.
    # Αν δεν θέλουμε αυτή την προσθήκη στο τέλος κάθε γραμμής, μπορούμε να το δηλώσουμε
    # γράφοντας στην συνάρτηση print --> print(firstline, end=''). Αυτό θα αφαιρέσει τους
    # χαρακτήρες '\n' που πιθανώς θα υπάρχουν στο τέλος κάθε γραμμής που έχει διαβαστεί.


print(firstline)
print(secondline)

f.close()