# Άσκηση εμπέδωσης
#
# Ας δημιουργήσουμε μια κλάση με το όνομα 'Car' με χαρακτηριστικά όπως
# 'make', 'model', 'year'.
# Αρχικοποιήστε ένα αντικείμενο της κλάσης με τις λεπτομέρειες του αγα-
# πημένου μας αυτοκινήτου.
# Στη συνέχεια, προσθέστε μια μέθοδο με το όνομα 'start_engine' που ε-
# κτυπώνει ένα μήνυμα όπως
#           Το [year] [make] [model] ξεκινάει τη μηχανή

class Car:
    def __init__(self, make, model, year):
        self.make = make
        self.model = model
        self.year = year
    
    def start_engine(self):
        print(f'Το {self.year} {self.make} {self.model} ξεκινάει τη μηχανή')


# Αρχικοποίηση ενός αντικειμένου και κλήση της μεθόδου start_engine
my_car = Car('Toyota', 'Corolla', 2022)
my_car.start_engine()

# Σε αυτή τη λύση, καθορίζουμε την κλάση 'Car' με τα χαρακτηριστικά 'make'
# 'model' και 'year' στον κατασκευαστή '__init__'. Ορίζεται επίσης η μέθοδος
# 'start_engine', η οποία απλώς να εκτυπώνει ένα μύνημα χρησιμοποιώντας τις
# τιμές των χαρακτηριστικών.
#
# Στη συνέχεια, δημιουργούμε ένα αντικείμενο 'my_car' με τη μάρκα 'Toyota'
# το μοντέλο 'Corolla' και το έτος 2022. Τέλος, καλούμε τη μέθοδο 'start_engine'
# στο 'my_car', η οποία εκτυπώνει το επιθυμητό μήνυμα.


#
#   ###
#       Μπορούμε ελέυθερα να τροποποιήσουμε τον κώδικα ανάλογα με τις
#       προτιμήσεις σας και να δοκιμάσετε διάφορες τιμές χαρακτηριστικών
#       για να εξερευνήσετε περαιτέρω
#   ###