# Τροποποίηση των τιμών των χαρακτηριστικών
#
#
# Συχνά, μπορεί να χρειαστεί να τροποποιήσουμε τις τιμές των χαρακτηριστικών
# μετά τη δημιουργία του αντικειμένου. Μπορούμε να το κάνουμε αυτό αντιστοι-
# χίζοντας άμεσα νέες τιμές στα χαρακτηριστικά χρησιμοποιώντας τη σημείωση με
# τελεία (dot notation). Ας τροποποιήσουμε το χαρακτηριστικό age του 'person1'.
#
#                   person1.age = 26
#                   print(person1.age)
#
# Με την αντιστοίχιση μιας νέας τιμής στο γνώρισμα 'age', έχουμε ενημερώσει την
# τιμή του γνωρίσματος για το 'person1'. Όταν εκτυπώνουμε 'person1.age', αντι-
# κατοπτρίζει την ενημερωμένη τιμή του: 26
#
# Οποότε, σε αυτήν την ενότητα, εξερευνήσαμε πώς να ορίσουμε χαρακτηριστικά, να
# αρχικοποιήσουμε αντικείμενα, να έχουμε πρόσβαση στις τιμές τους και να πραγμα-
# τοποιήσουμε λειτουργίες χρησιμοποιώντας μεθόδους.
#
# Αυτές οι έννοιες αποτελούν τα θεμέλια των κλάσεων στην Python.