# Μετατροπή αρχείων py-to-exe
#
#
# Είναι επόμενο πως σαν χρήστες Windows, θα μας εξυπηρετούσε αρκετές
# φορές να έχουμε διαθέσιμα αρχεία executables, δηλαδή με κατάληξη .exe
# που όπως γνωρίζουμε είναι η κατάληξη των εκτελέσιμων αρχείων των Windows
#
#
# Προσθήκη της Python στο Windows path
# -------------------------------------
# Αν δεν το έχουμε κάνει ήδη, μπορούμε να το κάνουμε τώρα, είτε
# επανεγκαθιστώντας την Python, (ή εγκαθιστώντας μια νεότερη έκδοση)
# και προσέχοντας κατά την εγκατάσταση να κάνουμε τικ στο ειδικό
# κουτάκι το οποίο μας ζητάει την άδεια για να «Add Python to Windows
# path”, είτε χειροκίνητα, ακολουθώντας τα παρακάτω βήματα:
# Πατάμε WinKey + R
# Πληκτρολογούμε sysdm.cpl
# Πάμε στην καρτέλα «Για προχωρημένους»
# Επιλέγουμε «Μεταβλητές περιβάλλοντος»
# Κάτω από το πεδίο Μεταβλητές χρήστη, πατάμε «Δημιουργία» και μας
# παρουσιάζεται ένα παραθυράκι στο οποίο πρέπει να συμπληρώσουμε 2
# πεδία.
# Πρέπει να γνωρίζουμε το μονοπάτι της Python, αν όχι, μπορούμε από
# τον IDLE, να κάνουμε κλικ στο «Αρχείο» → «Άνοιγμα» και να κάνουμε
# αντιγραφή το path από το παραθυράκι που μας ανοίγει, ακυρώνοντας
# κατόπιν το άνοιγμα αρχείου.
# Θα χρειαστούμε 2 paths: To application path και το scripts path. Το
# πρώτο θα είναι όπως παρακάτω, δηλαδή:
# C:\Users\User\AppData\Local\Programs\Python\Python311
# ενώ το δεύτερο:
# C:\Users\User\AppData\Local\Programs\Python\Python311\scripts
# Στο πεδίο Όνομα μεταβλητής πληκτρολογούμε “Path” και στο πεδίο
# «Τιμή μεταβλητής», βάζουμε και τα δύο paths, χωρισμένα με ελληνικό
# ερωτηματικό, δηλαδή:
# C:\Users\User\AppData\Local\Programs\Python\Python311;
# C:\Users\User\AppData\Local\Programs\Python\Python311\scripts
# Πατάμε ΟΚ και ξανά ΟΚ κι έχουμε ολοκληρώσει.
#
#
#
# Εγκατάσταση του πακέτου PyInstaller
# -----------------------------------
# Ανοίγουμε το command prompt και πληκτρολογούμε
#           python -m pip install pyinstaller
#
#
#
#
#
# Δημιουργία εκτελέσιμου αρχείου
# ------------------------------
# Πάμε τώρα να δημιουργήσουμε το εκτελέσιμο αρχείο:
# Πλοηγούμαστε στον φάκελο όπου βρίσκεται το αρχείο .py, το οποίο
# θέλουμε να μετατρέψουμε επίσης σε .exe. Αυτό το κάνουμε στο
# command prompt των Windows, πληκτρολογώντας cd και το path,
# δηλαδή:
# cd C:\Users\User\AppData\Local\Programs\Python\Python311
# Τώρα, δίνουμε την εντολή:
# pyinstaller –onefile onomaarxeiou.py
# και πατάμε το Enter.
# Αφού η διαδικασία ολοκληρωθεί, θα βρούμε το εκτελέσιμό μας στον
# φάκελο dist με το όνομα onomaarxeiou.exe.
