# exercise 3
#
# Γράψτε ένα πρόγραμμα για να μετρήσετε τους άρτιους και τους περιττούς αριθμούς σε μια δεδομένη
# λίστα ακεραίων  χρησιμοποιώντ5ας τις lambda functions.
#
# Αρχική λίστα: [1, 2, 3, 4, 5, 7, 8, 9, 10]
#
# Η εκτύπωση πρέπει να είναι:
#   Αριθμός ζευγών αριθμών στην παραπάνω λίστα: <αριθμός>
#   Αριθμός περιττών αριθμών στην παραπάνω λίστα: <αριθμός>
#
# Σημείωση: Χρησιμοποιώντας τις συναρτήσεις len(list(filter(lambda...

array_nums = [1, 2, 3, 4, 5, 7, 8, 9, 10]
print("Αρχική λίστα:", array_nums)

odd_ctr = len(list(filter(lambda x: (x % 2 != 0), array_nums)))
even_ctr = len(list(filter(lambda x: (x % 2 == 0), array_nums)))

print("\nΑριθμός περιττών αριθμών στην παραπάνω λίστα: ", even_ctr)
print("\nΑριθμός περιττών αριθμών στην παραπάνω λίστα: ", odd_ctr)

