# exercise 4
#
# Γράψτε μια συνάρτηση η οποία να υπολογίζει το μέγιστο Κοινό Διαιρέτη δύο αριθμών.
# Χρησιμοποιήστε τα ζευγάρια αριθμών 12 και 17, 4 και 6, 336 και 360

def gcd(x, y):
    gcd = 1
    if x % 2 == 0:
        return y
    for k in range(int(y / 2), 0, -1):
        if x % k == 0 and y % k == 0:
            gcd = k
            break
    return gcd



print("Ο ΜΚΔ των 12 & 37 είναι ο", gcd(12, 37))
print("Ο ΜΚΔ των 4 & 6 είναι ο", gcd(4, 6))
print("Ο ΜΚΔ των 336 & 360 είναι ο", gcd(336, 360))
