# exercise 1
#
# γράψτε ένα πρόγραμμα για να δημιουργήσετε μια συνάρτηση lambda που προσθέτει τον αριθμό 15 σε έναν
# αριθμό που μεταβιβάζεται ως όρισμα αφού ζητηθεί από τον χρήστη. Δημιουργήστε επίσης μια συνάρτηση
# lambda που πολλαπλασιάζει το όρισμα x με το όρισμα y (τα ζητάει και τα δύο από το χρήστη) και
# εκτυπώνει το αποτέλεσμα.

a = int(input('Give a number: '))
r = lambda a: a + 15
print(r(a))

x = int(input('Give a number: '))
y = int(input('Give a number: '))
r = lambda x, y: x * y
print(r(x, y))