# Ορισμός και έννοιες
#
#   Ο αντικειμενοστραφής προγραμματισμός είναι μια παραδοχή ή μεθοδολογία προγραμματισμού που
#   επιτρέπει την οργάνωση κώδικα σε αυτόνομες μονάδες που ονομάζονται "αντικείμενα". Ένα
#   αντικείμενο είναι ένα πρότυπο ή μια "εκδοχή", ή ένα στιγμιότυπο μιας κλάσης και περιέχει
#   δεδομένα (μεταβλητές) και μεθόδους (συναρτήσεις) που δρουν πάνω σε αυτά τα δεδομένα
#
#
#   Πλεονεκτήματα αντικειμενοστραφούς προγραμματισμού
#       - Ανακλαστικότητα (Reflection): Η δυνατότητα ενός αντικειμένου να "κατανοεί" τον εαυτό
#                                       και τις ιδιότητές του
#       - Επαναχρησιμοποίηση κώδικα: Η δυνατότητα να δημιουργούμε κλάσεις και αντικείμενα που
#                                    μπορούν να επαναχρησιμοποιηθούν σε διάφορα μέρη του προ-
#                                    γράμματος.
#       - Κληρονομικότητα (inheritance): Η δυνατότητα μιας κλάσης να κληρονομεί τις ιδιότητες
#                                        και τις συμπεριφορές μιας άλλης κλάσης.
#       - Πολυμορφισμός (Polymorphism): Η δυνατότητα μιας μεθόδου να έχει διαφορετική συμερι-
#                                       φορά, ανάλογα με τον τύπο του αντικειμένου που την καλεί.
#
#
#
#   Κλάσεις
#       Ορισμός: Μια κλάση είναι ένα πρότυπο ή ένα καλούπι για τη δημιουργία των αντικειμένων.
#                Ορίζουμε τις μεταβλητές και τις συναρτήσεις που ανήκουν σε αυτήν την κλάση.
#
#       Αναγνώριση κλάσεων και αντικειμένων
#           Μια κλάση αναγνωρίζεται από το όνομά της, ενώ ένα αντικείμενο είναι μια συγκεκριμένη
#           εκδοχή (ή ένα στιγμιότυπο) της κλάσης. Ένα αντικείμενο δημιουργείται από μια κλάση
#           και έχει τη δυνατότητα να προσπελαστεί και να τροποποιηθεί.
#
#       Χαρακτηριστικά συμπεριφορά μιας κλάσης
#           Ένα χαρακτηριστικό μιας κλάσης είναι μια μεταβλητή που αποθηκεύει δεδομένα για το
#           αντικείμενο. Μια συμπεριφορά μιας κλάσης είναι μια συνάρτηση που εκτελεί ενέργειες
#           πάνω στα δεδομένα του αντικειμένου
#
#       Ορίζοντας μια κλάση στην Python
#           Για να ορίσουμε μια κλάση στην Python, χρησιμοποιούμε τη λέξη-κλειδί "class"
#           ακο9λουθούμενη από το όνομα της κλάσης. Συνήθως, ορίζουμε τα χαρακτηριστικά και τις
#           συμπεριφορές μέσα σε έναν κατασκευαστή (constructor) και άλλες μεθόδους μέσα στην
#           κλάση.
#
