# Παραδείγματα κληρονομικότητας και πολυμορφισμού
#
#
# Μια κλάση είναι ένα καλούπι από το οποίο μπορούμε να δημιουργήσουμε αντικείμενα. Η κληρονομικότητα
# επιτρέπει τη δημιουργία νέων κλάσεων που βασίζονται σε ήδη υπάρχουσες κλάσεις, επαυξάνοντας ή
# τροποποιόντας τη λειτουργικότητά τους.
#
# Για να ορίσουμε μια κλάση, χρησιμοποιούμε τη λέξη-κλειδί "class" και το όνομα της κλάσης, ακολουθούμενο
# από δύο άνω και κάτω τελείες.
#
# Εδώ έχουμε ένα παράδειγμα μιας κλάσης "Person":
class Person:
    def __init__(self, name):
        self.name = name
        
    def greet(self):
        print("Γεια σας, είμαι ο ", self.name)
        

# 
# Στο παραπάνω παράδειγμα, η κλάση "Person" έχει έναν constructor (__init__) που δέχεται το όνομα του ατόμου
# και αποθηκεύει αυτό το όνομα στη μεταβλητή "name". Επίσης, η κλάση έχει μια μέθοδο "greet" που εκτυπώνει ένα
# μήνυμα χαιρετισμού με το όνομα του ατόμου.
#
# Για να δημιουργήσουμε ένα αντικείμενο από μια κλάση, χρησιμοποιούμε τη σύνταξη
#                   "όνομα = Κλάση()"
# με τυχόν  παραμέτρους.
#
# Παρακάτω έχουμε ένα παράδειγμα χρήσης της κλάσης "Person":
person = Person("John Doe")
person.greet()


#
# Το παραπάνω κομμάτι κώδικα δημιουργεί ένα νέο αντικείμενο "Person" από την κλάση "Person" και καλεί τη μέθοδο
# "greet". Έτσι, εκτυπώνεται το μήνυμα χαιρετισμού με το όνομα που έχει δωθεί.
