# Δημιουργία δικής μας κλάσης
#
#
# Ορισμός της κλάσης
#   Για να δημιουργήσουμε μια κλάση χρησιμοποιούμε τη λέξη-κλειδί "class"
#   ακολουθούμενη από το όνομα της κλάσης. Μέσα στην κλάση ορίζουμε τα
#   χαρακτηριστικά και τις μεθόδους που θα έχει η κλάση.
#
# Συναρτήσεις μέλη
#   Οι συναρτήσεις μέλη είναι μέθοδοι που ανήκουν σε μια κλάση. Αυτές οι
#   μέθοδοι μπορούν να εκτελέσουν ενέργειες σε αντικείμενα της κλάσης και
#   να αλληλεπιδρούν με τα χαρακτηριστικά τους.
#
# Μεταβλητές μέλη
#   Οι μεταβλητές μέλη είναι μεταβλητές που ανήκουν σε μια κλάση. Αυτές οι
#   μεταβλητές αποθηκεύουν δεδομένα για τα αντικείμενα της κλάσης και μπο-
#   ρούν να προσπελαστούν και να τροποποιηθούν από τις μεθόδους της κλάσης.
#
# Αρχικοποίηση αντικειμένων
#   Η αρχικοποίηση αντικειμένων γίνεται μέσω του κατασκευαστή (constructor)
#   της κλάσης. Ο κατασκευαστής είναι μια ειδική μέθοδος που καλείται κατά τη
#   δημιουργία ενός αντικειμένου και χρησιμοποιείται για την αρχικοποίηση των
#   μεταβλητών μελών.
#
# Πρόσβαση σε μέλη της κλάσης
#   Για να προσπελάσουμε τα μέλη μιας κλάσης, χρησιμοποιούμε τη σύνταξη
#                           "αντικείμενο.μέλος"
#   Μπορούμε να αναφερθούμε στα χαρακτηριστικά ή να καλέσουμε  τις μεθόδους
#   του αντικειμένου.